# Pandas Review Part III

## Combining Datasets: Merge and Join

### Categories of Joins

In [0]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [0]:
pd.merge(df1, df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [0]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [0]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                     'supervisor': ['Carly', 'Guido', 'Steve']})

In [0]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [0]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [0]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})

In [0]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [0]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [0]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [0]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [0]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

### Specification of the Merge Key

In [0]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [0]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

In [0]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [0]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [0]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [0]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [0]:
pd.merge(df1a, df3, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

### Specifying Set Arithmetic for Joins

In [0]:
 df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],                            
                     'food': ['fish', 'beans', 'bread']},                           
                    columns=['name', 'food'])
 df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],                            
                     'drink': ['wine', 'beer']},                           
                    columns=['name', 'drink'])

In [0]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [0]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [0]:
pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

In [0]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [0]:
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [0]:
pd.merge(df6, df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

### Overlapping Column Names: The suffixes Keyword

In [0]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],                            
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],                            
                    'rank': [3, 1, 4, 2]})

In [0]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [0]:
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [0]:
pd.merge(df8, df9, on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [0]:
pd.merge(df8, df9, on='name', suffixes=['_one', '_two'])

   name  rank_one  rank_two
0   Bob         1         3
1  Jake         2         1
2  Lisa         3         4
3   Sue         4         2

### Example: US States Data

In [0]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv 
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv 
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 57935  100 57935    0     0   254k      0 --:--:-- --:--:-- --:--:--  254k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   835  100   835    0     0   3479      0 --:--:-- --:--:-- --:--:--  3464
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   872  100   872    0     0   4152      0 --:--:-- --:--:-- --:--:--  4152

In [0]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

In [0]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [0]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [0]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [0]:
areas_abbrevs = pd.merge(areas, abbrevs, left_on='state', right_on='state', how='outer')
areas_abbrevs.head()

        state  area (sq. mi) abbreviation
0     Alabama          52423           AL
1      Alaska         656425           AK
2     Arizona         114006           AZ
3    Arkansas          53182           AR
4  California         163707           CA

In [0]:
merged = pd.merge(areas_abbrevs, pop, left_on='abbreviation', right_on='state/region', how='inner')
merged.head()

     state  area (sq. mi) abbreviation state/region     ages  year  population
0  Alabama          52423           AL           AL  under18  2012   1117489.0
1  Alabama          52423           AL           AL    total  2012   4817528.0
2  Alabama          52423           AL           AL  under18  2010   1130966.0
3  Alabama          52423           AL           AL    total  2010   4785570.0
4  Alabama          52423           AL           AL  under18  2011   1125763.0

In [0]:
merged.drop('abbreviation', axis=1, inplace=True)
merged.head()

     state  area (sq. mi) state/region     ages  year  population
0  Alabama          52423           AL  under18  2012   1117489.0
1  Alabama          52423           AL    total  2012   4817528.0
2  Alabama          52423           AL  under18  2010   1130966.0
3  Alabama          52423           AL    total  2010   4785570.0
4  Alabama          52423           AL  under18  2011   1125763.0

In [0]:
merged.isnull().any()

state            False
area (sq. mi)    False
state/region     False
ages             False
year             False
population       False
dtype: bool

---

## Aggregation and Grouping

### Planets Data

In [0]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

(1035, 6)

### Simple Aggregation in Pandas

In [0]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [0]:
ser.sum()

2.811925491708157

In [0]:
ser.mean()

0.5623850983416314

In [0]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [0]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [0]:
df.mean(axis=1)

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [0]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [0]:
planets.method.head()

0    Radial Velocity
1    Radial Velocity
2    Radial Velocity
3    Radial Velocity
4    Radial Velocity
Name: method, dtype: object

In [0]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

### GroupBy: Split, Apply, Combine

In [0]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],                           
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [0]:
df.groupby('key')

In [0]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [0]:
df.groupby('key').mean()

     data
key
A     1.5
B     2.5
C     3.5

In [0]:
planets.method.unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [0]:
planets.groupby('method').mean()

                                 number  ...         year
method                                   ...
Astrometry                     1.000000  ...  2011.500000
Eclipse Timing Variations      1.666667  ...  2010.000000
Imaging                        1.315789  ...  2009.131579
Microlensing                   1.173913  ...  2009.782609
Orbital Brightness Modulation  1.666667  ...  2011.666667
Pulsar Timing                  2.200000  ...  1998.400000
Pulsation Timing Variations    1.000000  ...  2007.000000
Radial Velocity                1.721519  ...  2007.518987
Transit                        1.954660  ...  2011.236776
Transit Timing Variations      2.250000  ...  2012.500000

[10 rows x 5 columns]

In [0]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [0]:
for (method, group) in planets.groupby('method'):
    print('{0:30s} shape{1}'.format(method, group.shape))

Astrometry                     shape(2, 6)
Eclipse Timing Variations      shape(9, 6)
Imaging                        shape(38, 6)
Microlensing                   shape(23, 6)
Orbital Brightness Modulation  shape(3, 6)
Pulsar Timing                  shape(5, 6)
Pulsation Timing Variations    shape(1, 6)
Radial Velocity                shape(553, 6)
Transit                        shape(397, 6)
Transit Timing Variations      shape(4, 6)

In [0]:
for (method, group) in planets.groupby('method'):
    print(method, group, sep='\n')

Astrometry
         method  number  orbital_period  mass  distance  year
113  Astrometry       1          246.36   NaN     20.77  2013
537  Astrometry       1         1016.00   NaN     14.98  2010
Eclipse Timing Variations
                       method  number  orbital_period  mass  distance  year
32  Eclipse Timing Variations       1        10220.00  6.05       NaN  2009
37  Eclipse Timing Variations       2         5767.00   NaN    130.72  2008
38  Eclipse Timing Variations       2         3321.00   NaN    130.72  2008
39  Eclipse Timing Variations       2         5573.55   NaN    500.00  2010
40  Eclipse Timing Variations       2         2883.50   NaN    500.00  2010
41  Eclipse Timing Variations       1         2900.00   NaN       NaN  2011
42  Eclipse Timing Variations       1         4343.50  4.20       NaN  2012
43  Eclipse Timing Variations       2         5840.00   NaN       NaN  2011
44  Eclipse Timing Variations       2         1916.25   NaN       NaN  2011
Imaging
       method  number  orbital_period  mass  distance  year
29    Imaging       1             NaN   NaN     45.52  2005
30    Imaging       1             NaN   NaN    165.00  2007
31    Imaging       1             NaN   NaN    140.00  2004
33    Imaging       1             NaN   NaN       NaN  2008
34    Imaging       1             NaN   NaN    145.00  2013
35    Imaging       1             NaN   NaN    139.00  2004
36    Imaging       1             NaN   NaN     18.39  2006
47    Imaging       1         6000.00   NaN     19.28  2008
54    Imaging       1             NaN   NaN     52.03  2012
68    Imaging       1       318280.00   NaN      7.69  2008
69    Imaging       1             NaN   NaN    145.00  2008
70    Imaging       1             NaN   NaN     36.00  2013
71    Imaging       1             NaN   NaN    140.00  2010
72    Imaging       1         4639.15   NaN     12.21  2009
73    Imaging       1             NaN   NaN     52.40  2004
74    Imaging       1         7336.50   NaN     25.00  2009
75    Imaging       1         8679.70   NaN     26.67  2009
89    Imaging       1        10037.50   NaN     23.10  2011
90    Imaging       1             NaN   NaN       NaN  2006
124   Imaging       1             NaN   NaN     17.95  2013
150   Imaging       1             NaN   NaN    145.00  2010
392   Imaging       1             NaN   NaN     91.57  2013
423   Imaging       1             NaN   NaN     91.83  2013
577   Imaging       1             NaN   NaN     40.85  2006
635   Imaging       1             NaN   NaN     11.43  2010
639   Imaging       1             NaN   NaN    131.93  2010
643   Imaging       4       170000.00   NaN     39.94  2008
644   Imaging       4        69000.00   NaN     39.94  2008
645   Imaging       4        37000.00   NaN     39.94  2008
646   Imaging       4        18000.00   NaN     39.94  2010
900   Imaging       1        40000.00   NaN       NaN  2011
937   Imaging       1       730000.00   NaN       NaN  2006
948   Imaging       1             NaN   NaN    135.00  2013
949   Imaging       1             NaN   NaN    120.00  2013
950   Imaging       1             NaN   NaN       NaN  2010
957   Imaging       1             NaN   NaN       NaN  2008
1027  Imaging       1             NaN   NaN     19.20  2011
1029  Imaging       1             NaN   NaN     10.10  2012
Microlensing
           method  number  orbital_period  mass  distance  year
902  Microlensing       1             NaN   NaN       NaN  2008
903  Microlensing       1             NaN   NaN       NaN  2008
904  Microlensing       1             NaN   NaN       NaN  2009
905  Microlensing       1             NaN   NaN    3600.0  2013
906  Microlensing       1          2780.0   NaN       NaN  2011
907  Microlensing       1             NaN   NaN       NaN  2010
908  Microlensing       1          1970.0   NaN       NaN  2010
909  Microlensing       1             NaN   NaN    2300.0  2012
910  Microlensing       1             NaN   NaN    2800.0  2012
911  Microlensing       1             NaN   NaN    7720.0  2012
912  Microlensing       1             NaN   NaN    7560.0  2013
917  Microlensing       1             NaN   NaN       NaN  2004
918  Microlensing       1          3600.0   NaN       NaN  2005
919  Microlensing       1          3300.0   NaN       NaN  2006
920  Microlensing       1          3500.0   NaN       NaN  2005
921  Microlensing       2          1825.0   NaN       NaN  2008
922  Microlensing       2          5100.0   NaN       NaN  2008
923  Microlensing       1             NaN   NaN       NaN  2009
924  Microlensing       1             NaN   NaN    2570.0  2012
925  Microlensing       2             NaN   NaN    4080.0  2012
926  Microlensing       2             NaN   NaN    4080.0  2012
927  Microlensing       1             NaN   NaN    1760.0  2013
928  Microlensing       1             NaN   NaN    4970.0  2013
Orbital Brightness Modulation
                            method  number  ...  distance  year
787  Orbital Brightness Modulation       2  ...    1180.0  2011
788  Orbital Brightness Modulation       2  ...    1180.0  2011
792  Orbital Brightness Modulation       1  ...       NaN  2013

[3 rows x 6 columns]
Pulsar Timing
            method  number  orbital_period  mass  distance  year
941  Pulsar Timing       3       25.262000   NaN       NaN  1992
942  Pulsar Timing       3       66.541900   NaN       NaN  1992
943  Pulsar Timing       3       98.211400   NaN       NaN  1994
944  Pulsar Timing       1    36525.000000   NaN       NaN  2003
945  Pulsar Timing       1        0.090706   NaN    1200.0  2011
Pulsation Timing Variations
                          method  number  orbital_period  mass  distance  year
958  Pulsation Timing Variations       1          1170.0   NaN       NaN  2007
Radial Velocity
              method  number  orbital_period   mass  distance  year
0    Radial Velocity       1        269.3000   7.10     77.40  2006
1    Radial Velocity       1        874.7740   2.21     56.95  2008
2    Radial Velocity       1        763.0000   2.60     19.84  2011
3    Radial Velocity       1        326.0300  19.40    110.62  2007
4    Radial Velocity       1        516.2200  10.50    119.47  2009
..               ...     ...             ...    ...       ...   ...
914  Radial Velocity       1          6.9580   0.34       NaN  2014
915  Radial Velocity       1          5.1180   0.40       NaN  2014
916  Radial Velocity       1        121.7100   1.54       NaN  2014
939  Radial Velocity       1          4.4264    NaN       NaN  2012
940  Radial Velocity       1          2.1451    NaN       NaN  2012

[553 rows x 6 columns]
Transit
       method  number  orbital_period  mass  distance  year
91    Transit       1        1.508956   NaN       NaN  2008
92    Transit       1        1.742994   NaN     200.0  2008
93    Transit       1        4.256800   NaN     680.0  2008
94    Transit       1        9.202050   NaN       NaN  2008
95    Transit       1        4.037896   NaN       NaN  2009
...       ...     ...             ...   ...       ...   ...
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

[397 rows x 6 columns]
Transit Timing Variations
                        method  number  orbital_period  mass  distance  year
680  Transit Timing Variations       2        160.0000   NaN    2119.0  2011
736  Transit Timing Variations       2         57.0110   NaN     855.0  2012
749  Transit Timing Variations       3             NaN   NaN       NaN  2014
813  Transit Timing Variations       2         22.3395   NaN     339.0  2013

In [0]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [0]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],                           
                   'data1': range(6),                           
                   'data2': rng.randint(0, 10, 6)},                           
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      4
1   B      1      0
2   C      2      9
3   A      3      5
4   B      4      8
5   C      5      0

In [0]:
df.groupby('key').agg(['min', 'max', 'mean'])

    data1          data2
      min max mean   min max mean
key
A       0   3  1.5     4   5  4.5
B       1   4  2.5     0   8  4.0
C       2   5  3.5     0   9  4.5

In [0]:
df.groupby('key').agg([min, np.median, 'max'])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     4    4.5   5
B       1    2.5   4     0    4.0   8
C       2    3.5   5     0    4.5   9

In [0]:
df.groupby('key').aggregate({'data1': min,
                             'data2': np.mean})

     data1  data2
key
A        0    4.5
B        1    4.0
C        2    4.5

In [0]:
df.groupby('key').aggregate({'data1': [min, np.median, max],
                             'data2': [np.mean, sum]})

    data1            data2
      min median max  mean sum
key
A       0    1.5   3   4.5   9
B       1    2.5   4   4.0   8
C       2    3.5   5   4.5   9

In [0]:
def filter_func(x):
    return x['data2'].std() > 4

In [0]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  0.707107
B    2.12132  5.656854
C    2.12132  6.363961

In [0]:
df.groupby('key').filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      9
4   B      4      8
5   C      5      0

In [0]:
df

  key  data1  data2
0   A      0      4
1   B      1      0
2   C      2      9
3   A      3      5
4   B      4      8
5   C      5      0

In [0]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5   -0.5
1   -1.5   -4.0
2   -1.5    4.5
3    1.5    0.5
4    1.5    4.0
5    1.5   -4.5

In [0]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

In [0]:
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      4
1   B  0.125000      0
2   C  0.222222      9
3   A  0.333333      5
4   B  0.500000      8
5   C  0.555556      0

In [0]:
L = [0, 1, 0, 1, 2, 0]
df.groupby(L).sum()

   data1  data2
0      7     13
1      4      5
2      4      8

In [0]:
df2 = df.set_index('key')
df2

     data1  data2
key
A        0      4
B        1      0
C        2      9
A        3      5
B        4      8
C        5      0

In [0]:
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
df2.groupby(mapping).sum()

           data1  data2
consonant     12     17
vowel          3      9

In [0]:
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    4.5
b    2.5    4.0
c    3.5    4.5

In [0]:
df2.groupby({'A': 0, 'B': 1, 'C': 2}).sum()

   data1  data2
0      3      9
1      5      8
2      7      9

In [0]:
df2.groupby([str.lower, mapping]).sum()

             data1  data2
a vowel          3      9
b consonant      5      8
c consonant      7      9